DataProcessors/фин_НастройкаКомплектаБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>фин_НастройкаКомплектаБюджетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВводаВДействие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРазвертыванияКомплектаБюджетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВариантыРазвертыванияКомплектаБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КомпонентыКомплектаБюджетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компонент</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_КомпонентыМастерБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметрыКомплекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_УсловияИспользованияКомпонентМастерБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазрезыБюджетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бюджет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_КлассификаторБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_КлассификаторРазрезовБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Бюджеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бюджет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_КлассификаторБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредшествующийБюджет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетПоКоличеству</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетПоСумме</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомпонентМастерБюджета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_КомпонентыМастерБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтогиБюджета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ИтоговыеФункции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрезыУчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормируетсяПосле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоЦентру</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УточнениеРазрезов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_КлассификаторРазрезовБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрезИБ</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредшествующиеБюджеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бюджет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_КлассификаторБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предшественник</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_КлассификаторБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасчетныеСтавки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасчетныйПоказатель</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_КлассификаторРасчетныхПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПользовательскиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ПользовательскиеПараметрыКомплектаБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ПользовательскиеПараметрыКомплектаБюджетов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтмеченныеРазрезы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бюджет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_КлассификаторБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасчетныеОпцииБюджетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_УсловияИспользованияКомпонентМастерБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпискиДанныхКЗаполнению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписокДанных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_СпискиДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоответствияКЗаполнению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Соответствие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ВариантыПолученияСоответствийДляПервичныхДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/фин_НастройкаКомплектаБюджетов/Forms/ФормаПросмотраСтатейБюджета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Бюджет")=Ложь Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Бюджет 				= Параметры.Бюджет;
	
	ВыбранныеВарианты	= Параметры.ВыбранныеВарианты;
	ВыбранныеВариантыКБ.ЗагрузитьЗначения(ВыбранныеВарианты);
	
	Параметры.Свойство("АдресНастроек",АдресНастроек);
	
	УчетПоКоличеству 	= Параметры.УчетПоКоличеству;
	УчетПоСумме 		= Параметры.УчетПоСумме;
	РазрезыУчета.ЗагрузитьЗначения(Параметры.РазрезыУчета);
	
	Если АдресНастроек = "" Тогда
		СписокСтатей = фин_УправлениеБюджетнойМоделью.ПолучитьТаблицуПостатейногоСоставаБюджетов(ВыбранныеВарианты,Бюджет);
	Иначе
		ДанныеХранилища = ПолучитьИзВременногоХранилища(АдресНастроек);
		СписокСтатей = ДанныеХранилища.СтатьиБюджетов.Скопировать(Новый Структура("Бюджет",Бюджет));
	КонецЕсли;
	
	Дерево = ДанныеФормыВЗначение(ДеревоСтатей,Тип("ДеревоЗначений"));
	
	Для Каждого СтрокаСтатей Из СписокСтатей Цикл
		Если ЗначениеЗаполнено(СтрокаСтатей.Родитель) Тогда
			Найдено = Дерево.Строки.НайтиСтроки(Новый Структура("Статья",СтрокаСтатей.Родитель),Истина);
			НоваяСтрока = Найдено[0].Строки.Добавить();
		Иначе
			НоваяСтрока = Дерево.Строки.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаСтатей,,"Родитель");
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.НаименованиеСтатьи) Тогда
			НоваяСтрока.НаименованиеСтатьи = СтрЗаменить(Строка(НоваяСтрока.Статья),"(группа)","");
		КонецЕсли;
		РазрезыСтатьи = Новый Структура(СтрокаСтатей.Разрезы);
		Для Каждого ЭлементРазрез Из РазрезыСтатьи Цикл
			Если РазрезыУчета.НайтиПоЗначению(Перечисления.фин_КлассификаторРазрезовБюджетов[ЭлементРазрез.Ключ])= Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока.СписокРазрезов = НоваяСтрока.СписокРазрезов + ?(НоваяСтрока.СписокРазрезов="","",", ")+Перечисления.фин_КлассификаторРазрезовБюджетов[ЭлементРазрез.Ключ];
		КонецЦикла;
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево,ДеревоСтатей);
	фин_БюджетированиеОбщегоНазначения.НастроитьОформлениеТабличногоПоля(Элементы.ДеревоСтатей);
КонецПроцедуры

&НаКлиенте
Процедура ПравилаРасчетаПоСтатье(Команда)
	Если Элементы.ДеревоСтатей.ТекущиеДанные<>Неопределено Тогда
		СтруктураПараметров = Новый Структура("СтатьяБюджета,ВыбранныеВарианты,АдресНастроек",Элементы.ДеревоСтатей.ТекущиеДанные.Статья,ВыбранныеВариантыКБ.ВыгрузитьЗначения(),АдресНастроек);
		ОткрытьФорму("Обработка.фин_НастройкаКомплектаБюджетов.Форма.ФормаСведенийОСтатье",СтруктураПараметров,ЭтотОбъект,Элементы.ДеревоСтатей.ТекущиеДанные.Статья,ВариантОткрытияОкна.ОтдельноеОкно);	
	КонецЕсли;
КонецПроцедуры
